In [ ]:
Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
data = [4,8,15,16,23,42]

In [4]:
df = pd.Series(data)

In [9]:
print(df)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [10]:
type(df)

pandas.core.series.Series

In [ ]:
Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [13]:
import pandas as pd

In [14]:
lst = [1,2,3,4,5,'a','b','c','d','e']

In [15]:
df = pd.Series(lst)

In [16]:
df

0    1
1    2
2    3
3    4
4    5
5    a
6    b
7    c
8    d
9    e
dtype: object

In [17]:
type(df)

pandas.core.series.Series

In [ ]:
Q3. Create a Pandas DataFrame that contains the following data:

In [18]:
import pandas as pd

In [19]:
df = pd.DataFrame({"Name":['Alice','Bob','Claire'],"Age":[25,30,27],"Gender":['Female','Male','Female']})

In [20]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [21]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [ ]:
DataFrame is a 2-dimensional labeled data structure with rows and columns of potentially different types where as pandas Series is a one-dimensional array.

In [22]:
df = pd.DataFrame({"Name":['Alice','Bob','Claire'],"Age":[25,30,27],"Gender":['Female','Male','Female']})

In [23]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [25]:
df = pd.Series({"Name":['Alice','Bob','Claire'],"Age":[25,30,27],"Gender":['Female','Male','Female']})

In [26]:
df

Name        [Alice, Bob, Claire]
Age                 [25, 30, 27]
Gender    [Female, Male, Female]
dtype: object

In [ ]:
Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [ ]:
.shape(), .info(), .corr() are some common functions we can use to manipulate data in pandas Dataframe.

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({"Name":['Alice','Bob','Claire'],"Age":[25,30,27],"Gender":['Female','Male','Female']})

In [3]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [12]:
df.shape

(3, 3)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [9]:
df.corr()

/tmp/ipykernel_77/1134722465.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr()

     Age
Age  1.0

In [ ]:
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

series - immutable
DataFrame, Panel - mutable

In [ ]:
Q7. Create a DataFrame using multiple Series. Explain with an example.

In [36]:
import pandas as pd

In [84]:
Age1= pd.Series([23,34,25,45,56])
Age2= pd.Series([18,21,32,19,34])
Age3= pd.Series([46,33,22,52,18])

In [85]:
Age1

0    23
1    34
2    25
3    45
4    56
dtype: int64

In [86]:
Age2

0    18
1    21
2    32
3    19
4    34
dtype: int64

In [87]:
Age3

0    46
1    33
2    22
3    52
4    18
dtype: int64

In [88]:
df = pd.DataFrame([Age1,Age2,Age3])

In [89]:
df

    0   1   2   3   4
0  23  34  25  45  56
1  18  21  32  19  34
2  46  33  22  52  18